<?php

namespace App\Http\Controllers;
use App\Application\Services\DBMessageService;
use App\Domain\Interfaces\IAuthRepository;
use App\Http\Requests\Auth\UsernameRequest;


class Enums{


    /**
     * @lrd:start
     * دریافت enum
     *
     * gender جنسیت
     *
     * notice_type نوع تذکر
     *
     * public_court_result نتیجه بررسی در صحن علنی مجلس
     *
     * commission_result نتیجه بررسی کمیسیون
     *
     * meeting اجلاسیه
     *
     * @lrd:end
     */
    public function index(){
        return response()->json([
            'app_name' => 'معاونت پارلمانی ریاست جمهوری',
            'yes_no' => [
                "no" => 'خیر',
                "yes" => 'بله'
            ],
            'actvie_deactive' => [
                "active" => 'غیرفعال',
                "deactive" => 'فعال'
            ],
            'accept_reject' => [
                "reject" => 'عدم تایید',
                "accept" => 'تایید شده'
            ],
            'task_status' => [
                "done" => 'انجام شده',
                "undone" => 'انجام نشده'
            ],
            'gender' => [
                'male' => 'آقا',
                'female' => 'خانم'
            ],
            'notice_type' => [
                '1' => 'کتبی',
                '2' => 'شفاهی',
                '3' => 'نطق میان دستور',
                '4' => 'تذکر آئین نامه ای',
                '5' => 'اخطار قانون اساسی'
            ],
            'public_court_result' => [
                '1' => 'قبل از رسیدگی در صحن نماینده انصراف داد',
                '2'=> 'نماینده از توضیحات وزیر قانع شد',
                '3'=> 'نمایندگان از توضیحات وزیر قانع شدند',
                '4' => 'نمایندگان از توضیحات وزیر قانع نشدند'
            ],
            'commission_result' => [
                '1' => ' انصراف قبل از برگزاری کمیسیون',
                '2' => 'نماینده قانع شد',
                '3' => 'مهلت اقدام به مقام مربوطه داده شد',
                '4' => 'نماینده قانع نشد'
            ],
            'meeting' => [
                '1' => 'اول',
                '2' => 'دوم',
                '3' => 'سوم',
                '4' => 'چهارم'
            ],
            'deputy' => [
                '1' => 'معاون اول ریاست جمهوری',
                '2' => 'معاون اجرایی رئیس جمهور و سرپرست نهاد ریاست جمهوری',
                '3' => 'معاون رئیس جمهور و رئیس سازمان امور اداری و استخدامی کشور',
                '4' => 'معاون رئیس جمهور و رئیس سازمان انرژی اتمی',
                '6' => 'معاون رئیس جمهور و رئیس سازمان برنامه و بودجه',
                '7' => 'معاون رئیس جمهور و رئیس بنیاد شهید و امور ایثارگران کشور',
                '8' => 'معاون حقوقی رئیس جمهور',
                '9' => 'معاون راهبردی رئیس جمهور',
                '10' => 'معاون رئیس جمهور در امور زنان و خانواده',
                '11' => 'معاون علمی، فناوری و اقتصاد دانش بنیان رئیس جمهور',
                '12' => 'معاون امور مجلس رئیس جمهور',
                '13' => 'معاون رئیس جمهور و رئیس سازمان حفاظت محیط زیست',
                '14' => 'معاون رئیس جمهور در امور توسعه روستایی و مناطق محروم کشور',
            ],
            'other_position' =>[
                '1' => 'رئیس دفتر رئیس جمهور',
                '2' => 'دبیر هیئت دولت',
                '3' => 'سرپرست وزارت امور اقتصادی و دارایی',
                '4' => 'سخنگوی دولت',
            ],
            'roles' => [
                'admin' => 'ادمین',
                'ministry_boss' => 'وزارتخانه',
                'editor' => 'کارگزار',
                'user' => 'کاربر'
            ],
            'gov_cabinet' => [
                '100' => 'معاون اول ریاست جمهوری',
                '101' => 'وزیر آموزش و پرورش',
                '102' => 'رئیس دفتر رئیس‌جمهور',
                '103' => 'وزیر ارتباطات و فناوری اطلاعات',
                '104' => 'دبیر هیئت دولت',
                '105' => 'وزیر اطلاعات',
                '106' => 'معاون اجرایی رئیس جمهور و سرپرست نهاد ریاست جمهوری',
                '107' => 'سرپرست وزارت امور اقتصادی و دارایی',
                '108' => 'معاون رئیس جمهور و رئیس سازمان امور اداری و استخدامی کشور',
                '109' => 'وزیر بهداشت، درمان و آموزش پزشکی',
                '110' => 'معاون رئیس‌جمهور و رئیس سازمان انرژی اتمی',
                '111' => 'وزیر تعاون، كار و رفاه اجتماعی',
                '112' => 'معاون رئیس جمهور و رئیس سازمان برنامه و بودجه',
                '113' => 'وزیر جهادکشاورزی',
                '114' => 'معاون رئیس جمهور و رئیس بنیاد شهید و امور ایثارگران کشور',
                '115' => 'وزیر امور خارجه',
                '116' => 'معاون حقوقی رئیس‌جمهور',
                '117' => 'وزیر دادگستری',
                '118' => 'معاون راهبردی و امور مجلس رئیس جمهور',
                '119' => 'وزیر دفاع و پشتیبانی نیروهای مسلح',
                '120' => 'معاون رئیس‌جمهور در امور زنان و خانواده',
                '121' => 'وزیر راه و شهرسازی',
                '122' => 'معاون علمی ،‌ فناوری و اقتصاد دانش بنیان رییس جمهور',
                '123' => 'وزیر صنعت، معدن و تجارت',
                '124' => 'معاون رئیس‌ جمهور و رئیس سازمان حفاظت محیط زیست',
                '125' => 'وزیر علوم، تحقیقات و فناوری',
                '126' => 'معاون رئیس جمهور در امور توسعه روستایی و مناطق محروم کشور',
                '127' => 'وزیر فرهنگ و ارشاد اسلامی',
                '128' => 'رئیس شورای اطلاع رسانی دولت',
                '129' => 'وزیر کشور',
                '130' => 'سخنگوی دولت',
                '131' => 'وزیر میراث فرهنگی،‌گردشگری و صنایع دستی',
                '132' => 'رئیس بانک مرکزی جمهوری اسلامی ایران',
                '133' => 'وزیر نفت',
                '134' => 'وزیر نیرو',
                '135' => 'وزیر ورزش و جوانان'
            ]
        ]);
    }



}
